:PROPERTIES:
:ID: 2d6e8ab1-0c18-42b0-984f-5054def0641e
:END:
#+TITLE: How to port a Unix pipeline to a Babashka script

[[file:..][..]]

[[id:5345d063-8018-4bde-8574-8ab9df27f479][Babashka]] is a great way to write shell scripts.
But Unix pipelines are also great!
Want to know how to make those pipelines in Babashka?
Please read on.

Here's a Unix pipeline count count how many times I've mentioned Lisp on my site:

#+begin_src bash :exports both
find .. | grep index.org | xargs cat | grep -i lisp | wc -l
#+end_src

#+RESULTS:
: 57

Let's translate that pipeline step by step to Babashka.

#+begin_src bash :exports both
bb -e <<EOF
(+ 1 2 3)
EOF
#+end_src

#+RESULTS:
